[Failed_Login_Attempt]
description = Detect repeated failed authentication attempts
search = index=windows_security EventCode=4625 | stats count by Source_Network_Address, host, Account_Name | where count >= 5
cron_schedule = */5 * * * *
disabled = 0
severity = medium

[Failed_Login_Attempts]
description = Detect repeated failed login activity
search = index=windows_security EventCode=4625 | stats count by Source_Network_Address, host | where count >= 5
cron_schedule = */5 * * * *
disabled = 0
severity = medium

[RDP_brute_force_detection]
description = Detect repeated failed RDP logins
search = index=windows_security EventCode=4625 Logon_Type=10 | stats count by Source_Network_Address, host, Account_Name | where count >= 5
cron_schedule = */5 * * * *
disabled = 0
severity = high

[Successful_Login_Occur]
description = Detect successful logins from monitored hosts
search = index=windows_security EventCode=4624 | stats count by Source_Network_Address, host, Account_Name
cron_schedule = */5 * * * *
disabled = 0
severity = high
